; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	image2 - mode
	image0 - mode
	image1 - mode
	Star4 - direction
	Star2 - direction
	Star1 - direction
	Star0 - direction
	Star3 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(supports instrument1 image2)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star3)
	(supports instrument3 image2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument5 image2)
	(calibration_target instrument5 Star0)
	(supports instrument6 image1)
	(supports instrument6 image0)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(have_image Planet5 image2)
	(have_image Star6 image1)
	(have_image Star7 image2)
	(have_image Planet8 image1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 4
2. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 4
3. (turn_to satellite1 star6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star6)
   goals met: 0 of 4
4. (take_image satellite1 star6 instrument2 image1)
   added: (have_image star6 image1)
   goals met: 1 of 4
5. (turn_to satellite1 planet8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet8)
   goals met: 1 of 4
6. (take_image satellite1 planet8 instrument2 image1)
   added: (have_image planet8 image1)
   goals met: 2 of 4
7. (turn_to satellite1 planet5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet5)
   goals met: 2 of 4
8. (take_image satellite1 planet5 instrument2 image2)
   added: (have_image planet5 image2)
   goals met: 3 of 4
9. (turn_to satellite1 star7 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star7)
   goals met: 3 of 4
10. (take_image satellite1 star7 instrument2 image2)
   added: (have_image star7 image2)
   goals met: 4 of 4
